#Даны два числа. Вывести порядковый номер меньшего из них
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
if a < b:
    print("первое число")
else:
    print("второе число")