# Найдите минимум и максимум значений
d = {'a': 10, 'b': 20, 'c': 30}

a = min(d.values())
b = max(d.values())
print(a)
print(b)